In [1]:
import pandas as pd
import numpy as np

data_url = 'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Salaries.csv'
df = pd.read_csv(data_url, index_col=0)

df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [2]:
# Populate custom INFO table
compactInfoView = pd.DataFrame()
compactInfoView['Total Values'] = df.count()
compactInfoView['Unique Values'] = df.nunique()
compactInfoView['Null Values'] = df.isna().sum()
compactInfoView['Data Type'] = df.dtypes

display (compactInfoView.sort_values(by='Data Type'))

               Total Values  Unique Values  Null Values Data Type
yrs.since.phd           397             53            0     int64
yrs.service             397             52            0     int64
salary                  397            371            0     int64
rank                    397              3            0    object
discipline              397              2            0    object
sex                     397              2            0    object

***

# Section 2 with custom Dataframes

In this section, we practice various GROUPING related workflow operations on custom dataframes.

In [4]:
'''
    testing groupby() operation
'''
dfTemp = pd.DataFrame({'author':['a', 'a', 'b'], 'subreddit':['sr1', 'sr2', 'sr2']})
display (dfTemp)

authorGrp = dfTemp.groupby('author')
# display (authorGrp.get_group('a'))


# ------ check if mean value for group is bigger than 0.5 then assign it 1, else 0.
traderDF = pd.DataFrame({'Buy/Sell': [1, 0, 1, 1, 0, 1, 0, 0],
                   'Trader': ['A', 'A', 'B', 'B', 'B', 'C', 'C', 'C']})

display (traderDF)

traderGroup = traderDF.groupby('Trader')
traderAggs = traderGroup['Buy/Sell'].agg(['count', 'sum'])
traderMeans = traderGroup['Buy/Sell'].mean()

traderAggs['Buy/Sell'] = np.select(condlist=[traderMeans > 0.5, traderMeans < 0.5], choicelist=[1, 0], default=np.nan)

display (traderMeans)
display (traderAggs)

  author subreddit
0      a       sr1
1      a       sr2
2      b       sr2

   Buy/Sell Trader
0         1      A
1         0      A
2         1      B
3         1      B
4         0      B
5         1      C
6         0      C
7         0      C

Trader
A    0.500000
B    0.666667
C    0.333333
Name: Buy/Sell, dtype: float64

        count  sum  Buy/Sell
Trader
A           2    1       NaN
B           3    2       1.0
C           3    1       0.0

In [7]:
# PIVOT Table

df_pivot = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df_pivot

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [15]:
# from pandas.pivot_table import pivot_table
# df.pivot_table('C', 'D', 'E', aggfunc=np.sum, margins=True)

table_dfPivot = df_pivot.pivot_table(values='D', index=['A', 'B'],
                     columns=['C'], aggfunc=np.sum, fill_value=0)
table_dfPivot

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [23]:
table_dfPivot = df_pivot.pivot_table(values='D', index=['A', 'C'],
                     columns=['B'], aggfunc=np.sum, fill_value=0)
table_dfPivot

B          one  two
A   C
bar large    4    7
    small    5    6
foo large    4    0
    small    1    6